---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCFamilyInstanceExtrusionExportResults.Dispose
source: html/14996f89-4959-8569-8f5f-e57a5ba38442.htm
---
# Autodesk.Revit.DB.IFC.IFCFamilyInstanceExtrusionExportResults.Dispose Method

Releases all resources used by the IFCFamilyInstanceExtrusionExportResults

## Syntax (C#)
```csharp
public void Dispose()
```